Repository: jazzymiles/greek_quiz
Catalog: lib/l10n/app_*.arb
Languages: el, ru

source: All dictionaries updated!
el: Όλα τα λεξικά ενημερώθηκαν!
ru: Все словари обновлены!

# answer_language_picker
source: Answer language
el: Γλώσσα απάντησης
ru: Язык ответа

# appearance_section_header
source: APPEARANCE
el: ΕΜΦΑΝΙΣΗ
ru: ВНЕШНИЙ ВИД

# answers_sounds_toggle
source: Answer sounds
el: Ήχοι απαντήσεων
ru: Звуки ответов

# autoplay_sound_toggle
source: Autoplay sound
el: Αυτόματη αναπαραγωγή ήχου
ru: Автовоспроизведение звука

# button_done
source: Done
el: Τέλος
ru: Готово

# card_mode_title
source: Cards
el: Κάρτες
ru: Карточки

# check_button
source: Check
el: Έλεγχος
ru: Проверить

# correct_answer_feedback
source: Correct!
el: Σωστό!
ru: Правильно!

# custom_url_label
source: URL of your dictionary (.json)
el: URL του λεξικού σας (.json)
ru: URL вашего словаря (.json)

# dictionaries_section_header
source: DICTIONARIES
el: ΛΕΞΙΚΑ
ru: СЛОВАРИ

# dictionary_source_picker
source: Source
el: Πηγή
ru: Источник

# display_section_header
source: DISPLAY
el: ΟΘΟΝΗ
ru: ОТОБРАЖЕНИЕ

source: Download and save dictionaries
el: Λήψη & αποθήκευση λεξικών
ru: Скачать и сохранить словари

source: Download error
el: Σφάλμα λήψης
ru: Ошибка скачивания

# download_success
source: Download successful
el: Επιτυχής λήψη
ru: Скачивание успешно

source: Downloading dictionaries...
el: Λήψη λεξικών...
ru: Скачивание словарей...

source: Enter dictionaries file address
el: Εισαγωγή διεύθυνσης αρχείου λεξικών
ru: Введите адрес файла словарей

source: Error loading dictionaries:
el: Σφάλμα φόρτωσης λεξικών:
ru: Ошибка загрузки словарей:

# error_no_dictionaries_selected
source: No dictionaries selected
el: Δεν έχουν επιλεγεί λεξικά
ru: Словари не выбраны

# error_no_words_loaded
source: No words loaded
el: Δεν φορτώθηκαν λέξεις
ru: Слова не загружены

# feedback_correct
source: Correct!
el: Σωστό!
ru: Правильно!

# feedback_wrong
source: Wrong!
el: Λάθος!
ru: Неправильно!

# help_navigation_title
source: Help
el: Βοήθεια
ru: Помощь

# incorrect_answer_feedback
source: Wrong. Correct answer:
el: Λάθος. Σωστή απάντηση:
ru: Неправильно. Правильный ответ:

# interface_language_picker
source: Interface language
el: Γλώσσα διεπαφής
ru: Язык интерфейса

# keyboard_mode_title
source: I'll write
el: Θα γράψω
ru: Я напишу

# language_el
source: Greek
el: Ελληνικά
ru: Греческий

# language_en
source: English
el: Утпдшыр
ru: Английский

# language_ru
source: Russian
el: Русский
ru: Русский

# language_system
source: System
el: Σύστημα
ru: Системный

# languages_section_header
source: LANGUAGES
el: ΓΛΩΣΣΕΣ
ru: ЯЗЫКИ

# next_button
source: Next
el: Επόμενο
ru: Далее

# no_dictionaries_available
source: No dictionaries available. Please download.
el: Δεν υπάρχουν διαθέσιμα λεξικά. Παρακαλώ κατεβάστε.
ru: Нет доступных словарей. Пожалуйста, скачайте.

source: No words loaded.
el: Δεν φορτώθηκαν λέξεις.
ru: Слова не загружены.

# picker_dialog_title
source: Select an option
el: Επιλογή
ru: Выберите вариант

# quiz_mode_title
source: Quiz
el: Κουίζ
ru: Тест

# rules_navigation_title
source: Rules
el: Κανόνες
ru: Правила

# score_label
source: Score:
el: Σκορ:
ru: Счёт:

# search_bar_placeholder
source: Search
el: Αναζήτηση
ru: Поиск

# select_dictionaries_title
source: Select Dictionaries
el: Επιλογή Λεξικών
ru: Выбор словарей

# show_answer_button
source: Show Answer
el: Εμφάνιση απάντησης
ru: Показать ответ

# show_article_toggle
source: Show article
el: Εμφάνιση άρθρου
ru: Показывать артикль

# show_transcription_toggle
source: Show transcription
el: Εμφάνιση μεταγραφής
ru: Показывать транскрипцию

# sound_section_header
source: SOUND
el: ΗΧΟΣ
ru: ЗВУК

# source_custom
source: Custom URL
el: Προσαρμοσμένο URL
ru: Пользовательский URL

# source_local
source: Built-in
el: Ενσωματωμένο
ru: Встроенный

# studied_language_picker
source: Study language
el: Γλώσσα μελέτης
ru: Изучаемый язык

# talk_show_mode_title
source: Talk Show
ru: Ток-шоу

# theme_dark
source: Dark
el: Σκοτεινό
ru: Тёмная

# theme_light
source: Light
el: Φωτεινό
ru: Светлая

# theme_picker
source: Theme
el: Θέμα
ru: Тема

# theme_system
source: System
el: Σύστημα
ru: Системная

# title_settings_navigation
source: Settings
el: Ρυθμίσεις
ru: Настройки

# use_all_words_in_answers
source: All the words in the answers
el: Όλες οι λέξεις στις απαντήσεις
ru: Все слова в ответах

# use_all_words_subtitle
source: For 'Quiz' and 'Cards' modes
el: Για λειτουργίες 'Κουίζ' και 'Κάρτες'
ru: Для режимов 'Тест' и 'Карточки'

# use_all_words_toggle
source: Use all words
el: Χρήση όλων των λέξεων
ru: Использовать все слова

# words_list_title
source: Words list
el: Λίστα λέξεων
ru: Список слов

# your_translation_placeholder
source: Your translation
el: Η μετάφρασή σας
ru: Ваш перевод

source: All dictionaries updated!
el: Όλα τα λεξικά ενημερώθηκαν!
ru: Все словари обновлены!

source: Answer in language
el: Απάντηση στη γλώσσα
ru: Отвечать на языке

# answersSoundsToggle
source: Answers sound
el: Ήχος απαντήσεων
ru: Звук ответов

# appearanceSettingsSection
source: Appearance Settings
el: Ρυθμίσεις εμφάνισης
ru: Настройки внешнего вида

# autoplaySoundToggle
source: Word sound
el: Ήχος λέξεων
ru: Звук слова

# buttonCheck
source: Check
el: Έλεγχος
ru: Проверить

# buttonClose
source: Close
el: Κλείσιμο
ru: Закрыть

# buttonDictionaries
source: Dictionaries
el: Λεξικά
ru: Словари

# buttonNext
source: Next
el: Επόμενο
ru: Далее

# buttonRefresh
source: Refresh
el: Ανανέωση
ru: Обновить

# buttonRules
source: Rules
el: Κανόνες
ru: Правила

# buttonSettings
source: Settings
el: Ρυθμίσεις
ru: Настройки

# button_show_words
source: Show words
el: Εμφάνιση λέξεων
ru: Показать слова

# buttonShowWords
source: Show words
el: Εμφάνιση λέξεων
ru: Показать слова

source: Clearing old dictionaries
el: Εκκαθάριση παλιών λεξικών
ru: Удаление старых словарей

# customUrlDictionaries
source: Custom URL (from internet)
el: Προσαρμοσμένο URL (από το διαδίκτυο)
ru: Пользовательский URL (из интернета)

# dictionariesSection
source: Dictionaries
el: Λεξικά
ru: Словари

# dictionaryDownloadOption1
source: Standart
el: Βασικό
ru: Стандартный

# dictionaryDownloadOption2
source: Personal
el: Προσωπικό
ru: Персональный

source: Dictionary Source
el: Πηγή λεξικού
ru: Источник словаря

# downloadStatus1
source: Downloading…
el: Λήψη...
ru: Скачивание...

# downloadStatusText
source: Loading dictionary:
el: Φόρτωση λεξικού:
ru: Загрузка словаря:

source: Downloading dictionaries list...
el: Λήψη λίστας λεξικών...
ru: Скачивание списка словарей...

# downloadingDictionary
source: Downloading dictionary: {dictionaryName} ({progress} of {total})...
el: Λήψη λεξικού: {dictionaryName} ({progress} από {total})...
ru: Скачивание словаря: {dictionaryName} ({progress} из {total})...

# englishLanguage
source: English
el: Αγγλικά
ru: Английский

# errorDownloadingDictionaries
source: Error downloading dictionaries: {error}
el: Σφάλμα λήψης λεξικών: {error}
ru: Ошибка скачивания словарей: {error}

# errorIncorrectDownloadUrl
source: Error: Invalid download URL.
el: Σφάλμα: Μη έγκυρο URL λήψης.
ru: Ошибка: Неверный URL для скачивания.

# errorInvalidDictionariesListUrl
source: Error: Invalid dictionaries list
el: Σφάλμα: Μη έγκυρη λίστα λεξικών
ru: Ошибка: Неверный список словарей

source: Error: Unknown dictionary source.
el: Σφάλμα: Άγνωστη πηγή λεξικού.
ru: Ошибка: Неизвестный источник словаря.

# greekLanguage
source: Greek
el: Ελληνικά
ru: Греческий

# greekLanguageOption
source: Greek
el: Ελληνικά
ru: Греческий

# helpUpdatedMessage
source: Help updated!
el: Η βοήθεια ενημερώθηκε!
ru: Помощь обновлена!

# helpViewTitle
source: Help
el: Βοήθεια
ru: Помощь

# interfaceLanguageSection
source: Interface Language
el: Γλώσσα διεπαφής
ru: Язык интерфейса

# languageGreek
source: Greek
el: Ελληνικά
ru: Греческий

# languageInterfacePicker
source: Interface Language
el: Γλώσσα διεπαφής
ru: Язык интерфейса

# languageOptionEnglish
source: English
el: Αγγλικά
ru: Английский

# languageOptionGreek
source: Greek
el: Ελληνικά
ru: Греческий

# languageOptionRussian
source: Russian
el: Ρωσικά
ru: Русский

# languageOptionSystem
source: System
el: Σύστημα
ru: Системный

# languageSettingsSection
source: Languages
el: Γλώσσες
ru: Языки

# learningSettingsSection
source: Learning Settings
el: Ρυθμίσεις εκμάθησης
ru: Настройки обучения

# loadingDictionariesMessage
source: Loading dictionary
el: Φόρτωση λεξικού
ru: Загрузка словаря

# modeCardsDisplayName
source: Cards
el: Κάρτες
ru: Карточки

# modeKeyboardDisplayName
source: Type In
el: Πληκτρολόγηση
ru: Ввод с клавиатуры

# modeQuizDisplayName
source: Quiz
el: Κουίζ
ru: Тест

# modeTalkshowDisplayName
source: Talk show
ru: Ток-шоу

# noAnswerSelectedFeedback
source: Error: No answer selected. Showing correct answer.
el: Σφάλμα: Δεν επιλέχθηκε απάντηση. Εμφάνιση σωστής απάντησης.
ru: Ошибка: Ответ не выбран. Показывается правильный ответ.

# palceHolderSearch
source: Search…
el: Αναζήτηση...
ru: Поиск...

# quizLanguageSection
source: Quiz Language
el: Γλώσσα κουίζ
ru: Язык теста

# quizSettingsSection
source: Quiz settings
el: Ρυθμίσεις κουίζ
ru: Настройки теста

# rulesUpdatedMessage
source: Rules updated!
el: Οι κανόνες ενημερώθηκαν!
ru: Правила обновлены!

# rulesViewTitle
source: Rules
el: Κανόνες
ru: Правила

# russianLanguage
source: Russian
el: Ρωσικά
ru: Русский

# searchPlaceholder
source: Search
el: Αναζήτηση
ru: Поиск

# selectAtLeastOneDictionary
source: Please select at least one dictionary. To do this, click the button at the top with this icon
el: Παρακαλώ επιλέξτε τουλάχιστον ένα λεξικό. Για να το κάνετε, πατήστε το κουμπί στην κορυφή με αυτό το εικονίδιο
ru: Пожалуйста, выберите хотя бы один словарь. Для этого нажмите на кнопку вверху с этим значком

source: Standard dictionaries
el: Βασικά λεξικά
ru: Стандартные словари

# studiedLanguagePicker
source: Studied language
el: Γλώσσα μελέτης
ru: Изучаемый язык

# themeApp
source: App Theme
el: Θέμα εφαρμογής
ru: Тема приложения

# themeAppTitle
source: App Theme
el: Θέμα εφαρμογής
ru: Тема приложения

# titleQuizMode
source: Quiz mode
el: Λειτουργία κουίζ
ru: Режим теста

# titleSelectDictionaries
source: Select dictionaries
el: Επιλογή λεξικών
ru: Выбор словарей

# titleWordsList
source: Words
el: Λέξεις
ru: Слова

# updateErrorMessage
source: Update error: {error}.
el: Σφάλμα ενημέρωσης: {error}.
ru: Ошибка обновления: {error}.

# wordsListTitle
source: Words list
el: Λίστα λέξεων
ru: Список слов

# answerLanguagePicker
source: Answer language
el: Γλώσσα απάντησης
ru: Язык ответа

# useAllWordsToggle
source: All the words in the answers
el: Όλες οι λέξεις στις απαντήσεις
ru: Все слова в ответах

# buttonDone
source: Done
el: Τέλος
ru: Готово

source: Download and save dictionaries
el: Λήψη & αποθήκευση λεξικών
ru: Скачать и сохранить словари

# enterDictionariesFileAddress
source: Enter dictionaries.txt file address
el: Εισαγωγή διεύθυνσης αρχείου dictionaries.txt
ru: Введите адрес файла dictionaries.txt

# showArticleToggle
source: Show articles
el: Εμφάνιση άρθρων
ru: Показывать артикли

# showTranscriptionToggle
source: Show transcription
el: Εμφάνιση μεταγραφής
ru: Показывать транскрипцию

# yourTranslationPlaceholder
source: Your translation
el: Η μετάφρασή σας
ru: Ваш перевод
